## FILES UPLOAD

In [1]:
import pandas as pd
import numpy as np

import warnings
warnings.filterwarnings('ignore')  # esto es para quitar prints

pd.set_option('display.max_columns', None)   # mostrar todas las columnas del df
#pd.set_option('display.max_rows', None)   # mostrar todas las filas del df

In [2]:
actor=pd.read_csv('../data/actor.csv')
category=pd.read_csv('../data/category.csv')
film=pd.read_csv('../data/film.csv')
inventory=pd.read_csv('../data/inventory.csv')
language=pd.read_csv('../data/language.csv')
old_HDD=pd.read_csv('../data/old_HDD.csv')
rental=pd.read_csv('../data/rental.csv')

In [3]:
film.isna().sum()

film_id                    0
title                      0
description                0
release_year               0
language_id                0
original_language_id    1000
rental_duration            0
rental_rate                0
length                     0
replacement_cost           0
rating                     0
special_features           0
last_update                0
dtype: int64

In [4]:
print('actor shape',actor.shape)
print('category shape',category.shape)
print('film shape',film.shape)
print('inventory shape',inventory.shape)
print('language shape',language.shape)
print('old_HDD shape',old_HDD.shape)
print('rental shape',rental.shape)

actor shape (200, 4)
category shape (16, 3)
film shape (1000, 13)
inventory shape (1000, 4)
language shape (6, 3)
old_HDD shape (1000, 5)
rental shape (1000, 7)

### Actor table

In [5]:
actor.head()

   actor_id first_name     last_name          last_update
0         1   PENELOPE       GUINESS  2006-02-15 04:34:33
1         2       NICK      WAHLBERG  2006-02-15 04:34:33
2         3         ED         CHASE  2006-02-15 04:34:33
3         4   JENNIFER         DAVIS  2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA  2006-02-15 04:34:33

In [6]:
actor.info(memory_usage='deep')   #no hay nulos en ninguna columna

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   actor_id     200 non-null    int64
 1   first_name   200 non-null    object
 2   last_name    200 non-null    object
 3   last_update  200 non-null    object
dtypes: int64(1), object(3)
memory usage: 41.0 KB

In [7]:
for c in actor.columns:       #valores unicos de cada columna
    
    columna=c
    
    print(c,'- valores únicos: ',len(actor[columna].unique()))

actor_id - valores únicos:  200
first_name - valores únicos:  128
last_name - valores únicos:  121
last_update - valores únicos:  1

In [8]:
actor['full_name']=actor.first_name+' '+actor.last_name

In [9]:
actor.tail()

     actor_id first_name last_name          last_update      full_name
195       196       BELA    WALKEN  2006-02-15 04:34:33    BELA WALKEN
196       197      REESE      WEST  2006-02-15 04:34:33     REESE WEST
197       198       MARY    KEITEL  2006-02-15 04:34:33    MARY KEITEL
198       199      JULIA   FAWCETT  2006-02-15 04:34:33  JULIA FAWCETT
199       200      THORA    TEMPLE  2006-02-15 04:34:33   THORA TEMPLE

In [10]:
actor.columns

Index(['actor_id', 'first_name', 'last_name', 'last_update', 'full_name'], dtype='object')

In [11]:
actor.drop('last_name', axis=1, inplace=True)

In [12]:
actor.drop('first_name',axis=1, inplace=True)

In [13]:
actor.drop('last_update', axis=1, inplace=True)

In [14]:
actor.columns

Index(['actor_id', 'full_name'], dtype='object')

In [15]:
actor.full_name.value_counts()

SUSAN DAVIS             2
EWAN GOODING            1
DARYL CRAWFORD          1
GRETA KEITEL            1
JANE JACKMAN            1
                       ..
MICHELLE MCCONAUGHEY    1
ADAM GRANT              1
SEAN WILLIAMS           1
GARY PENN               1
THORA TEMPLE            1
Name: full_name, Length: 199, dtype: int64

In [16]:
actor[actor.full_name=='SUSAN DAVIS']

     actor_id    full_name
100       101  SUSAN DAVIS
109       110  SUSAN DAVIS

In [17]:
actor.drop(109, axis=0,inplace=True)

In [18]:
actor.shape

(199, 2)

In [19]:
actor[actor.full_name=='SUSAN DAVIS']

     actor_id    full_name
100       101  SUSAN DAVIS

### Category table

In [20]:
category.head()

   category_id       name          last_update
0            1     Action  2006-02-15 04:46:27
1            2  Animation  2006-02-15 04:46:27
2            3   Children  2006-02-15 04:46:27
3            4   Classics  2006-02-15 04:46:27
4            5     Comedy  2006-02-15 04:46:27

In [21]:
category.info(memory_usage='deep')   #no hay nulos en ninguna columna

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16 entries, 0 to 15
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   category_id  16 non-null     int64
 1   name         16 non-null     object
 2   last_update  16 non-null     object
dtypes: int64(1), object(2)
memory usage: 2.4 KB

In [22]:
for c in category.columns:       #valores unicos de cada columna
    
    columna=c
    
    print(c,'- valores únicos: ',len(category[columna].unique()))

category_id - valores únicos:  16
name - valores únicos:  16
last_update - valores únicos:  1

In [23]:
category.columns

Index(['category_id', 'name', 'last_update'], dtype='object')

In [24]:
category.drop('last_update', axis=1, inplace=True)

In [25]:
category.columns

Index(['category_id', 'name'], dtype='object')

### Film table

In [59]:
film.head()

,film_id,title,description,language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,1,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes"
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,1,3,4.99,48,12.99,G,"Trailers,Deleted Scenes"
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,1,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes"
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,1,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes"
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,1,6,2.99,130,22.99,G,Deleted Scenes

In [27]:
film.info(memory_usage='deep')    #col5 todo nulos, el resto ninguno

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 13 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   film_id               1000 non-null   int64
 1   title                 1000 non-null   object
 2   description           1000 non-null   object
 3   release_year          1000 non-null   int64
 4   language_id           1000 non-null   int64
 5   original_language_id  0 non-null      float64
 6   rental_duration       1000 non-null   int64
 7   rental_rate           1000 non-null   float64
 8   length                1000 non-null   int64
 9   replacement_cost      1000 non-null   float64
 10  rating                1000 non-null   object
 11  special_features      1000 non-null   object
 12  last_update           1000 non-null   object
dtypes: float64(3), int64(5), object(5)
memory usage: 495.3 KB

In [28]:
for c in film.columns:       #valores unicos de cada columna
    
    columna=c
    
    print(c,'- valores únicos: ',len(film[columna].unique()))

film_id - valores únicos:  1000
title - valores únicos:  1000
description - valores únicos:  1000
release_year - valores únicos:  1
language_id - valores únicos:  1
original_language_id - valores únicos:  1
rental_duration - valores únicos:  5
rental_rate - valores únicos:  3
length - valores únicos:  140
replacement_cost - valores únicos:  21
rating - valores únicos:  5
special_features - valores únicos:  15
last_update - valores únicos:  1

In [29]:
film.columns

Index(['film_id', 'title', 'description', 'release_year', 'language_id',
       'original_language_id', 'rental_duration', 'rental_rate', 'length',
       'replacement_cost', 'rating', 'special_features', 'last_update'],
      dtype='object')

In [30]:
film.rating.value_counts()

PG-13    223
NC-17    210
R        195
PG       194
G        178
Name: rating, dtype: int64

In [31]:
film.drop('last_update', axis=1, inplace=True)     #no aporta info, y todas las filas son iguales

In [32]:
film.drop('release_year', axis=1, inplace=True)     #no aporta info, y todas las filas son iguales

In [33]:
film.drop('original_language_id', axis=1, inplace=True)    #los valores de toda la columna son nulos

In [34]:
film.columns

Index(['film_id', 'title', 'description', 'language_id', 'rental_duration',
       'rental_rate', 'length', 'replacement_cost', 'rating',
       'special_features'],
      dtype='object')

### Inventory table

In [35]:
inventory.head()

   inventory_id  film_id  store_id          last_update
0             1        1         1  2006-02-15 05:09:17
1             2        1         1  2006-02-15 05:09:17
2             3        1         1  2006-02-15 05:09:17
3             4        1         1  2006-02-15 05:09:17
4             5        1         2  2006-02-15 05:09:17

In [36]:
inventory.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   inventory_id  1000 non-null   int64
 1   film_id       1000 non-null   int64
 2   store_id      1000 non-null   int64
 3   last_update   1000 non-null   object
dtypes: int64(3), object(1)
memory usage: 97.8 KB

In [37]:
for c in inventory.columns:       #valores unicos de cada columna
    
    columna=c
    
    print(c,'- valores únicos: ',len(inventory[columna].unique()))

inventory_id - valores únicos:  1000
film_id - valores únicos:  207
store_id - valores únicos:  2
last_update - valores únicos:  1

In [38]:
inventory.columns

Index(['inventory_id', 'film_id', 'store_id', 'last_update'], dtype='object')

In [39]:
inventory.drop('last_update', axis=1, inplace=True)     #no aporta info, y todas las filas son iguales

In [40]:
inventory.columns

Index(['inventory_id', 'film_id', 'store_id'], dtype='object')

### Language table

In [41]:
language

   language_id      name          last_update
0            1   English  2006-02-15 05:02:19
1            2   Italian  2006-02-15 05:02:19
2            3  Japanese  2006-02-15 05:02:19
3            4  Mandarin  2006-02-15 05:02:19
4            5    French  2006-02-15 05:02:19
5            6    German  2006-02-15 05:02:19

In [42]:
language.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   language_id  6 non-null      int64
 1   name         6 non-null      object
 2   last_update  6 non-null      object
dtypes: int64(1), object(2)
memory usage: 1016.0 bytes

In [43]:
language.columns

Index(['language_id', 'name', 'last_update'], dtype='object')

In [44]:
language.drop('last_update', axis=1, inplace=True)     #no aporta info, y todas las filas son iguales

In [45]:
language.columns

Index(['language_id', 'name'], dtype='object')

### Old_HDD table

In [46]:
old_HDD.head()

  first_name last_name                  title  release_year  category_id
0   PENELOPE   GUINESS       ACADEMY DINOSAUR          2006            6
1   PENELOPE   GUINESS   ANACONDA CONFESSIONS          2006            2
2   PENELOPE   GUINESS            ANGELS LIFE          2006           13
3   PENELOPE   GUINESS  BULWORTH COMMANDMENTS          2006           10
4   PENELOPE   GUINESS          CHEAPER CLYDE          2006           14

In [47]:
old_HDD.info(memory_usage='deep')     #no hay valores nulos

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   first_name    1000 non-null   object
 1   last_name     1000 non-null   object
 2   title         1000 non-null   object
 3   release_year  1000 non-null   int64
 4   category_id   1000 non-null   int64
dtypes: int64(2), object(3)
memory usage: 207.6 KB

In [48]:
for c in old_HDD.columns:       #valores unicos de cada columna
    
    columna=c
    
    print(c,'- valores únicos: ',len(old_HDD[columna].unique()))

first_name - valores únicos:  38
last_name - valores únicos:  37
title - valores únicos:  614
release_year - valores únicos:  1
category_id - valores únicos:  16

In [49]:
old_HDD.drop('release_year', axis=1, inplace=True)     #no aporta info, y todas las filas son iguales

In [50]:
old_HDD.columns

Index(['first_name', 'last_name', 'title', 'category_id'], dtype='object')

In [64]:
old_HDD['full_name']=old_HDD.first_name+' '+old_HDD.last_name

In [66]:
old_HDD.drop(['first_name','last_name'],axis=1, inplace=True)

In [68]:
old_HDD.head()

                   title  category_id         full_name
0       ACADEMY DINOSAUR            6  PENELOPE GUINESS
1   ANACONDA CONFESSIONS            2  PENELOPE GUINESS
2            ANGELS LIFE           13  PENELOPE GUINESS
3  BULWORTH COMMANDMENTS           10  PENELOPE GUINESS
4          CHEAPER CLYDE           14  PENELOPE GUINESS

### Rental table

In [51]:
rental.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [52]:
rental.info(memory_usage='deep')     #no hay valores nulos

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   rental_id     1000 non-null   int64
 1   rental_date   1000 non-null   object
 2   inventory_id  1000 non-null   int64
 3   customer_id   1000 non-null   int64
 4   return_date   1000 non-null   object
 5   staff_id      1000 non-null   int64
 6   last_update   1000 non-null   object
dtypes: int64(4), object(3)
memory usage: 254.0 KB

In [53]:
for c in rental.columns:       #valores unicos de cada columna
    
    columna=c
    
    print(c,'- valores únicos: ',len(rental[columna].unique()))

rental_id - valores únicos:  1000
rental_date - valores únicos:  999
inventory_id - valores únicos:  1000
customer_id - valores únicos:  485
return_date - valores únicos:  997
staff_id - valores únicos:  2
last_update - valores únicos:  1

In [54]:
rental.drop('last_update', axis=1, inplace=True)     #no aporta info, y todas las filas son iguales

In [55]:
rental.columns

Index(['rental_id', 'rental_date', 'inventory_id', 'customer_id',
       'return_date', 'staff_id'],
      dtype='object')

In [69]:
actor.to_csv('../data/actor.csv', index=False)
category.to_csv('../data/category.csv', index=False)
film.to_csv('../data/film.csv', index=False)
inventory.to_csv('../data/inventory.csv', index=False)
language.to_csv('../data/language.csv', index=False)
old_HDD.to_csv('../data/old_HDD.csv', index=False)
rental.to_csv('../data/old_HDD.csv', index=False)

In [72]:
%pip install SQLAlchemy
%pip install pymysql

Collecting SQLAlchemy
  Downloading SQLAlchemy-1.4.42-cp37-cp37m-macosx_10_15_x86_64.whl (1.6 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 1.6/1.6 MB 1.6 MB/s eta 0:00:0000:0100:01
Requirement already satisfied: importlib-metadata in /opt/anaconda3/envs/clase/lib/python3.7/site-packages (from SQLAlchemy) (5.0.0)
Collecting greenlet!=0.4.17
  Downloading greenlet-2.0.0.post0-cp37-cp37m-macosx_10_15_x86_64.whl (200 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 200.1/200.1 kB 2.0 MB/s eta 0:00:00a 0:00:01
Requirement already satisfied: typing-extensions>=3.6.4 in /opt/anaconda3/envs/clase/lib/python3.7/site-packages (from importlib-metadata->SQLAlchemy) (4.4.0)
Requirement already satisfied: zipp>=0.5 in /opt/anaconda3/envs/clase/lib/python3.7/site-packages (from importlib-metadata->SQLAlchemy) (3.9.0)
Installing collected packages: greenlet, SQLAlchemy
Successfully installed SQLAlchemy-1.4.42 greenlet-2.0.0.post0
Note: you may need to restart the kernel to use updated packages.
Requirement already satisfied: pymysql in /opt/anaconda3/envs/clase/lib/python3.7/site-packages (1.0.2)
Note: you may need to restart the kernel to use updated packages.

In [73]:
from sqlalchemy import create_engine

In [78]:
# crear una base de datos

# string de conexion URI
# lenguaje+driver://usuario:password@servidor:puerto

str_conn='mysql+pymysql://root:ironhackali@localhost:3306/Rental_films'

cursor=create_engine(str_conn)

In [79]:
actor.to_sql(name='actor', con=cursor, if_exists='replace', index=False)

In [81]:
category.to_sql(name='category', con=cursor, if_exists='replace', index=False)

In [82]:
film.to_sql(name='film', con=cursor, if_exists='replace', index=False)

In [83]:
inventory.to_sql(name='inventory', con=cursor, if_exists='replace', index=False)

In [84]:
language.to_sql(name='language', con=cursor, if_exists='replace', index=False)

In [85]:
old_HDD.to_sql(name='fold_HDD', con=cursor, if_exists='replace', index=False)

In [86]:
rental.to_sql(name='rental', con=cursor, if_exists='replace', index=False)